# 데이터 로딩과 저장, 파일형식

In [17]:
import pandas as pd

### read_csv로 불러오기

In [13]:
df = pd.read_csv('ch06/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### read_table로 불러오기

In [12]:
df = pd.read_table('ch06/ex1.csv', sep=',')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### 컬럼이름 생성하기(자동)

In [11]:
df = pd.read_csv('ch06/ex1.csv', header = None)
df

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

### 컬럼이름 생성하기(직접)

In [10]:
col = ['a','b','c','d','message']
pd.read_csv('ch06/ex1.csv', names=col)

   a   b   c   d  message
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

### 메세지 컬럼을 인덱스로 지정하기

In [15]:
pd.read_csv('ch06/ex1.csv', names=col, index_col = 'message')

         a   b   c   d
message
message  a   b   c   d
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

### 계층적 인덱스 지정하기

In [17]:
parsed = pd.read_csv('ch06/csv_mindex.csv',index_col=['key1','key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

### 고정된 구분자 없이 공백이나 다른 패턴으로 필드를 구분한 파일

In [18]:
list(open('ch06/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [21]:
result = pd.read_table('ch06/ex3.txt', sep='\s+') # https://www.nextree.co.kr/p4327/ 정규표현식 참고
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

### 문장과 같이 예외처리 해야할 인자 예외처리

In [23]:
list(open('ch06/ex4.csv'))

['# hey!\n',
 'a,b,c,d,message\n',
 '# just wanted to make things more difficult for you\n',
 '# who reads CSV files with computers, anyway?\n',
 '1,2,3,4,hello\n',
 '5,6,7,8,world\n',
 '9,10,11,12,foo']

In [24]:
pd.read_csv('ch06/ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### 누락되어 특수하게 처리된 문자 'Null'로 처리하기

In [25]:
list(open('ch06/ex5.csv'))

['something,a,b,c,d,message\n',
 'one,1,2,3,4,NA\n',
 'two,5,6,,8,world\n',
 'three,9,10,11,12,foo']

In [27]:
result = pd.read_csv('ch06/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [28]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [29]:
result = pd.read_csv('ch06/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

### 컬럼별로 NA값으로 지정된 값 NA로 바꾸기

In [33]:
sentinels = {'message':['foo'], 'something':['two']}

In [34]:
pd.read_csv('ch06/ex5.csv',na_values = sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

## 텍스트 파일 조금씩 읽어오기

### 최대 10줄 출력하기

In [35]:
pd.options.display.max_rows = 10

In [37]:
result = pd.read_csv('ch06/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

### 첫 5줄만 읽기

In [38]:
pd.read_csv('ch06/ex6.csv',nrows = 5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

### 파일을 여러조각으로 나누어 읽기

In [40]:
chunker = pd.read_csv('ch06/ex6.csv', chunksize = 1000)
chunker

In [41]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
    
tot = tot.sort_values(ascending=False)

<ipython-input-41-03faebcbae4e>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

In [42]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

## 데이터를 텍스트 형식으로 기록하기

### csv파일로 만들기 ( , 로 구분)

In [43]:
data = pd.read_csv('ch06/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [44]:
data.to_csv('ch06/out.csv')

In [45]:
list(open('ch06/out.csv'))

[',something,a,b,c,d,message\n',
 '0,one,1,2,3.0,4,\n',
 '1,two,5,6,,8,world\n',
 '2,three,9,10,11.0,12,foo\n']

### ( | 로 구분)

In [3]:
import sys
data.to_csv(sys.stdout, sep='|')

NameError: name 'data' is not defined

### 누락된 값 'NULL'을 삽입

In [48]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

### row와 column은 제외하기

In [49]:
data.to_csv(sys.stdout, index=False, header = False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

### 일부 또는 직접 지정하기

In [50]:
data.to_csv(sys.stdout, index = False, columns = ['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

### Series에서 csv파일로 저장하기

In [2]:
import numpy as np

In [51]:
dates = pd.date_range('16/5/2021',periods = 7)

In [54]:
ts = pd.Series(np.arange(7), index = dates)

In [55]:
ts.to_csv('ch06/tseries.csv')

In [56]:
list(open('ch06/tseries.csv'))

[',0\n',
 '2021-05-16,0\n',
 '2021-05-17,1\n',
 '2021-05-18,2\n',
 '2021-05-19,3\n',
 '2021-05-20,4\n',
 '2021-05-21,5\n',
 '2021-05-22,6\n']

## 구분자 형식 다루기

In [59]:
list(open('ch06/ex7.csv'))

['"a","b","c"\n', '"1","2","3"\n', '"1","2","3","4"\n']

### 파이썬 내장 csv 모듈 이용하기

In [60]:
import csv
f = open('ch06/ex7.csv')

reader = csv.reader(f)

In [61]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3', '4']

### 해당 파일을 단위 리스트로 저장

In [74]:
with open('ch06/ex7.csv') as f:
    lines = list(csv.reader(f))

In [68]:
header, values = lines[0], lines[1:]
print(header)
print(values)

['a', 'b', 'c']
[['1', '2', '3'], ['1', '2', '3', '4']]

In [69]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

### csv 모듈에 있는 csv.Dialect 클래스를 상속받아 다양한 구분자 문자열을 처리하는 새로운 클래스를 정의

In [79]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
    
# reader = csv.reader(f, dialect=my_dialect)

In [78]:
# reader = csv.reader(f, delimiter = '|')

### csv파일 기록하기

In [89]:
with open('ch06/mydata.csv','w') as f:
    writer = csv.writer(f, dialect = my_dialect)
    writer.writerow(('one','two','three'))
    writer.writerow(('1','2','3'))
    writer.writerow(('4','5','6'))
    writer.writerow(('7','8','9'))

In [90]:
list(open('ch06/mydata.csv'))

['one;two;three\n', '1;2;3\n', '4;5;6\n', '7;8;9\n']

## JSON 데이터

### json 문자열을 파이썬 형태로 변환하기

In [93]:
import json

In [96]:
obj = '''
{"name":"Wes",
"places_lived" : ["United States", "Spain","Germany"],
"pet" : null,
"siblings" : [{"name":"Scott", "age" : 30, "pets" : ["Zeus","Zuko"]},
                {"name":"Katie", "age" : 38, "pets" :["Sixes","Stache","Cisco"]}]
}
'''

In [98]:
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

### 파이썬 객체를 json형태로 변환하기

In [101]:
asjson = json.dumps(result)

In [102]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

### JSON 객체를 DataFrame으로 변환하기

In [105]:
siblings = pd.DataFrame(result['siblings'], columns = ['name','age','pets'])
siblings

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

In [5]:
data = pd.read_json('ch06/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [6]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [7]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

## XML과 HTML: 웹 스크래핑

### 미연방예금보험공사 부도은행 데이터 활용

#### https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/

In [46]:
colnames = ['Bank Name','City','ST','CERT','Acquiring Institution','Closing Date','Fund']
tables = pd.read_html('ch06/FDIC _ Failed Bank List.html')
len(tables)

1

In [49]:
failures = tables[0]

In [52]:
failures.columns = colnames

In [53]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Fund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534

In [54]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2017      8
2015      8
2016      5
2019      4
2020      4
2001      4
2004      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

## lxml.objecify를 이용해서 xml 파싱하기

### getroot 함수를 이용해서 xml파일의 루트 노드에 대한 참조하기

In [ ]:
from lxml import objectify

path = 'ch06/Performance_MNR.xml'
parsed =